is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg144.h
#define _LATH_LATH12_POSITION                    0x0000000C
#define _LATH_LATH12_MASK                        0x00001000
#define _LATH_LATH12_LENGTH                      0x00000001

#define _LATH_LATH13_POSITION                    0x0000000D
#define _LATH_LATH13_MASK                        0x00002000
#define _LATH_LATH13_LENGTH                      0x00000001

#define _LATH_LATH14_POSITION                    0x0000000E
#define _LATH_LATH14_MASK                        0x00004000
#define _LATH_LATH14_LENGTH                      0x00000001

#define _LATH_LATH15_POSITION                    0x0000000F
#define _LATH_LATH15_MASK                        0x00008000
#define _LATH_LATH15_LENGTH                      0x00000001

#define _LATH_w_POSITION                         0x00000000
#define _LATH_w_MASK                             0xFFFFFFFF
#define _LATH_w_LENGTH                           0x00000020

#define _ODCH_ODCH0_POSITION                     0x00000000
#define _ODCH_ODCH0_MASK                         0x00000001
#define _ODCH_ODCH0_LENGTH                       0x00000001

#define _ODCH_ODCH1_POSITION                     0x00000001
#define _ODCH_ODCH1_MASK                         0x00000002
#define _ODCH_ODCH1_LENGTH                       0x00000001

#define _ODCH_ODCH2_POSITION                     0x00000002
#define _ODCH_ODCH2_MASK                         0x00000004
#define _ODCH_ODCH2_LENGTH                       0x00000001

#define _ODCH_ODCH3_POSITION                     0x00000003
#define _ODCH_ODCH3_MASK                         0x00000008
#define _ODCH_ODCH3_LENGTH                       0x00000001

#define _ODCH_ODCH4_POSITION                     0x00000004
#define _ODCH_ODCH4_MASK                         0x00000010
#define _ODCH_ODCH4_LENGTH                       0x00000001

#define _ODCH_ODCH5_POSITION                     0x00000005
#define _ODCH_ODCH5_MASK                         0x00000020
#define _ODCH_ODCH5_LENGTH                       0x00000001

#define _ODCH_ODCH6_POSITION                     0x00000006
#define _ODCH_ODCH6_MASK                         0x00000040
#define _ODCH_ODCH6_LENGTH                       0x00000001

#define _ODCH_ODCH7_POSITION                     0x00000007
#define _ODCH_ODCH7_MASK                         0x00000080
#define _ODCH_ODCH7_LENGTH                       0x00000001

#define _ODCH_ODCH8_POSITION                     0x00000008
#define _ODCH_ODCH8_MASK                         0x00000100
#define _ODCH_ODCH8_LENGTH                       0x00000001

#define _ODCH_ODCH9_POSITION                     0x00000009
#define _ODCH_ODCH9_MASK                         0x00000200
#define _ODCH_ODCH9_LENGTH                       0x00000001

#define _ODCH_ODCH10_POSITION                    0x0000000A
#define _ODCH_ODCH10_MASK                        0x00000400
#define _ODCH_ODCH10_LENGTH                      0x00000001

#define _ODCH_ODCH11_POSITION                    0x0000000B
#define _ODCH_ODCH11_MASK                        0x00000800
#define _ODCH_ODCH11_LENGTH                      0x00000001

#define _ODCH_ODCH12_POSITION                    0x0000000C
#define _ODCH_ODCH12_MASK                        0x00001000
#define _ODCH_ODCH12_LENGTH                      0x00000001

#define _ODCH_ODCH13_POSITION                    0x0000000D
#define _ODCH_ODCH13_MASK                        0x00002000
#define _ODCH_ODCH13_LENGTH                      0x00000001

#define _ODCH_ODCH14_POSITION                    0x0000000E
#define _ODCH_ODCH14_MASK                        0x00004000
#define _ODCH_ODCH14_LENGTH                      0x00000001

#define _ODCH_ODCH15_POSITION                    0x0000000F
#define _ODCH_ODCH15_MASK                        0x00008000
#define _ODCH_ODCH15_LENGTH                      0x00000001

#define _ODCH_w_POSITION                         0x00000000
#define _ODCH_w_MASK                             0xFFFFFFFF
#define _ODCH_w_LENGTH                           0x00000020

#define _CNPUH_CNPUH0_POSITION                   0x00000000
#define _CNPUH_CNPUH0_MASK                       0x00000001
#define _CNPUH_CNPUH0_LENGTH                     0x00000001

#define _CNPUH_CNPUH1_POSITION                   0x00000001
#define _CNPUH_CNPUH1_MASK                       0x00000002
#define _CNPUH_CNPUH1_LENGTH                     0x00000001

#define _CNPUH_CNPUH2_POSITION                   0x00000002
#define _CNPUH_CNPUH2_MASK                       0x00000004
#define _CNPUH_CNPUH2_LENGTH                     0x00000001

#define _CNPUH_CNPUH3_POSITION                   0x00000003
#define _CNPUH_CNPUH3_MASK                       0x00000008
#define _CNPUH_CNPUH3_LENGTH                     0x00000001

#define _CNPUH_CNPUH4_POSITION                   0x00000004
#define _CNPUH_CNPUH4_MASK                       0x00000010
#define _CNPUH_CNPUH4_LENGTH                     0x00000001

#define _CNPUH_CNPUH5_POSITION                   0x00000005
#define _CNPUH_CNPUH5_MASK                       0x00000020
#define _CNPUH_CNPUH5_LENGTH                     0x00000001

#define _CNPUH_CNPUH6_POSITION                   0x00000006
#define _CNPUH_CNPUH6_MASK                       0x00000040
#define _CNPUH_CNPUH6_LENGTH                     0x00000001

#define _CNPUH_CNPUH7_POSITION                   0x00000007
#define _CNPUH_CNPUH7_MASK                       0x00000080
#define _CNPUH_CNPUH7_LENGTH                     0x00000001

#define _CNPUH_CNPUH8_POSITION                   0x00000008
#define _CNPUH_CNPUH8_MASK                       0x00000100
#define _CNPUH_CNPUH8_LENGTH                     0x00000001

#define _CNPUH_CNPUH9_POSITION                   0x00000009
#define _CNPUH_CNPUH9_MASK                       0x00000200
#define _CNPUH_CNPUH9_LENGTH                     0x00000001

#define _CNPUH_CNPUH10_POSITION                  0x0000000A
#define _CNPUH_CNPUH10_MASK                      0x00000400
#define _CNPUH_CNPUH10_LENGTH                    0x00000001

#define _CNPUH_CNPUH11_POSITION                  0x0000000B
#define _CNPUH_CNPUH11_MASK                      0x00000800
#define _CNPUH_CNPUH11_LENGTH                    0x00000001

#define _CNPUH_CNPUH12_POSITION                  0x0000000C
#define _CNPUH_CNPUH12_MASK                      0x00001000
#define _CNPUH_CNPUH12_LENGTH                    0x00000001

#define _CNPUH_CNPUH13_POSITION                  0x0000000D
#define _CNPUH_CNPUH13_MASK                      0x00002000
#define _CNPUH_CNPUH13_LENGTH                    0x00000001

